/*
Localizations.strings
NovaFoundation

Created by Logan Collins on 6/22/16.
Copyright © 2016 Panic Inc. All rights reserved.
*/


// General
"None" = "None";


// Clips
"Editor" = "Editor";
"Terminal" = "Terminal";
"Plain Text" = "Texte brut";

"SELECTED_TEXT" = "Text Selection";
"DATE" = "Date";
"FILENAME" = "Filename";
"FILE_PATH" = "File Path";
"PARENT_FOLDER" = "Parent Folder";
"WORKSPACE_NAME" = "Project Name";
"AUTHOR_NAME" = "Author Name";
"SCM_REVISION" = "SCM Revision";
"PREVIOUS_TEXT" = "Previous Text";
"PASTEBOARD_TEXT" = "Pasteboard Text";


// Keyboard
"Space" = "Space";
"Insert" = "Insérer";
"Clear" = "Clear";
"Help" = "Aide";


// Extensions
"The extension “%@” was not found." = "The extension “%@” was not found.";
"The extension “%@” experienced an error." = "The extension “%@” experienced an error.";
"The extension “%@” could not be loaded because it requires %@ %@ or later." = "The extension “%@” could not be loaded because it requires %@ %@ or later.";

"No command found with the name “%@”." = "No command found with the name “%@”.";
"Check to make sure the extension for the command is installed and up to date." = "Check to make sure the extension for the command is installed and up to date.";

"No assistant found with the name “%@”." = "No assistant found with the name “%@”.";
"Check to make sure the extension for the assistant is installed and up to date." = "Check to make sure the extension for the assistant is installed and up to date.";

"The extension “%@” is already installed." = "The extension “%@” is already installed.";
"If you would like to modify the provided extension, copy it outside of the extensions container directory and open it as a workspace." = "If you would like to modify the provided extension, copy it outside of the extensions container directory and open it as a workspace.";

"An extension with the identifier “%@” is already installed." = "An extension with the identifier “%@” is already installed.";
"The version being installed is either older or not compatible. Remove the existing extension before attempting to install another." = "The version being installed is either older or not compatible. Remove the existing extension before attempting to install another.";

"Could not locate the extension in the unarchived package." = "Could not locate the extension in the unarchived package.";
"The extension download server returned an unexpected status code (%d)." = "The extension download server returned an unexpected status code (%d).";
"An error was returned from the Extension Library." = "An error was returned from the Extension Library.";

"Authentication failed." = "L’authentification a échoué.";

"ExtensionCategoryName_clips" = "Clips";
"ExtensionCategoryName_commands" = "Commandes";
"ExtensionCategoryName_completions" = "Fins de mot";
"ExtensionCategoryName_debuggers" = "Débogueurs";
"ExtensionCategoryName_formatters" = "Formateurs";
"ExtensionCategoryName_issues" = "Validateurs";
"ExtensionCategoryName_key-bindings" = "Raccourcis clavier";
"ExtensionCategoryName_languages" = "Langages";
"ExtensionCategoryName_tasks" = "Tâches";
"ExtensionCategoryName_sidebars" = "Barres latérales";
"ExtensionCategoryName_themes" = "Thèmes";


// Extension Validation
"No extension logo image found." = "Aucune image de logo d’extension trouvée.";
"A primary image is required named \"extension.png\" at the root of the extension bundle." = "Une image primaire nommée “extension.png” est requise à la racine du lot d’extensions.";

"Extension primary image too large." = "L’image primaire d’extension est trop grande.";
"The extension's primary image should not be larger than 512px." = "L’image principale de l’extension ne doit pas dépasser 512 px.";

"No extension name specified." = "Aucun nom d’extension spécifié.";
"A user-readable name must be specified for the extension." = "Un nom lisible par l’utilisateur doit être spécifié pour l’extension.";

"No extension description specified." = "Aucune description d’extension spécifiée.";
"Providing a description helps to illustrate the usefulness of your extension to users." = "L’ajout d’une description aide à illustrer l’utilité de vos extensions aux utilisateurs.";

"Invalid version number specified." = "Numéro de version invalide spécifié.";
"Version numbers for extensions should follow a scheme such as \"xx.yy.zz\"." = "Les numéros de version d’extension doivent adopter un système de numérotation sémantique comme “xx.yy.zz”.";

"Version number is the same or older." = "Numéro de version identique ou plus ancien.";
"The updated extension version number is the same or older than the currently published version. Bump your extension's version number to submit an update." = "Le numéro de version de l’extension mise à jour est identique ou antérieur à la version actuellement publiée. Augmentez le numéro de version de votre extension pour soumettre une mise à jour.";

"No organization specified." = "Aucun nom de fournisseur spécifié.";
"A user-readable organization name must be specified for the extension." = "Un nom de fournisseur lisible par l’utilisateur doit être spécifié pour l’extension.";

"The \"author\" metadata key is no longer supported." = "La clé de métadonnées “author” est obsolète.";
"Use of the \"author\" key should be replaced with the \"organization\" key instead." = "L’utilisation de la clé “author” doit être remplacée par la clé “organization”.";

"The \"vendor\" metadata key is no longer supported." = "La clé de métadonnées “vendor” est obsolète.";
"Use of the \"vendor\" key should be replaced with the \"organization\" key instead." = "L’utilisation de la clé “vendor” doit être remplacée par la clé “organization”.";

"No extension activation events specified." = "Aucun événement d’activation d’extension spécifié";
"One or more activation events must be specified for extensions that include scripts." = "Un ou plusieurs événements d’activation doivent être spécifiés pour les extensions incluant des scripts.";

"No extension categories specified." = "Aucune catégorie d’extensions spécifiée.";
"Specifying categories helps users to find your extension in the library." = "Spécifier des catégories aide les utilisateurs à trouver votre extension dans la bibliothèque.";

"Invalid extension category: \"%@\"." = "Catégorie d’extensions invalide : “%@”.";
"Ensure that the category identifiers you have specified exactly match those available in the documentation." = "Assurez-vous que les identifiants de catégorie que vous avez spécifiés correspondent exactement à ceux qui se trouvent dans la documentation.";

"Missing components for category: \"%@\"." = "Éléments manquants pour la catégorie : “%@”.";
"Extensions using the Clips category must include at least one set of clips for the Clips sidebar." = "Les extensions qui utilisent la catégorie Clips doivent inclure au moins un ensemble de clips pour la barre latérale Clips.";
"Extensions using the Commands category must include at least one command" = "Les extensions qui utilisent la catégorie Commandes doivent inclure au moins une commande";
"Extensions using the Key Bindings category must include at least one key binding set." = "Les extensions qui utilisent la catégorie Raccourcis clavier doivent inclure au moins un ensemble de raccourcis clavier.";
"Extensions using the Sidebars category must include at least one sidebar definition." = "Les extensions qui utilisent la catégorie Barres latérales doivent inclure au moins une définition de barre latérale.";
"Extensions using the Tasks category must include at least one task configuration template definition." = "Les extensions qui utilisent la catégorie Tâches doivent inclure au moins une définition de modèle de configuration de tâches.";
"Extensions using the Themes category must include at least one theme." = "Les extensions qui utilisent la catégorie Thèmes doivent inclure au moins un thème.";

"A main script was specified but not found." = "Un script principal a été spécifié, mais il est introuvable.";
"The extension specifies a main script named “%@”, but the file could not be read. Check to ensure this file exists within the extension's \"Scripts/\" folder." = "L’extension spécifie un script principal nommé “%@”, mais le fichier n’a pas pu être lu. Assurez-vous que ce fichier existe dans le dossier “Scripts/” de l’extension.";

"No bug reporting link specified." = "Aucun lien de rapport de bug spécifié.";
"Specifying a bug reporting link helps users to submit issues related to your extension. Specify a URL and / or email address using the \"bugs\" key in your extension's manifest." = "Spécifier un lien de rapport de bug aide les utilisateurs à signaler des problèmes liés à votre extension. Spécifiez une URL ou une adresse e-mail avec la clé “bugs” dans le manifeste de votre extension.";

"No Readme found." = "Aucun fichier Lisez-moi trouvé.";
"A README.md file is required. Place this file in the root of the extension." = "Un fichier README.md est nécessaire. Placez ce fichier à la racine de l’extension.";

"No Change Log found." = "Aucun journal de modifications trouvé.";
"A CHANGELOG.md file is required. Place this file in the root of the extension." = "Un fichier CHANGELOG.md est nécessaire. Placez ce fichier à la racine de l’extension.";

"Missing architectures in grammar library." = "Architectures manquantes dans la bibliothèque de grammaire.";
"The grammar \"%@\" is missing one or more required architectures: (%@)." = "La grammaire “%@” ne possède pas une ou plusieurs architectures requises : (%@).";

"Invalid code signature for grammar library." = "Signature de code non valide pour la bibliothèque de grammaire.";
"The grammar \"%@\" does not have a valid code signature: %@." = "La grammaire “%@” ne possède pas de signature de code valide : %@.";
